Revit 2026 API

# IExternalServiceGetVendorId Method

---

Implement this method to return the vendor Id of the service.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
string GetVendorId()
```
```vb
Function GetVendorId As String
```
```cpp
String^ GetVendorId()
```
```fsharp
abstract GetVendorId : unit -> string
```

#### Return Value

String Vendor Id of the service.

The Id is expected to be a string consisting of 4 characters.

#### Reference

IExternalService Interface

Autodesk.Revit.DB.ExternalService Namespace